In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {
    'Country': ['China', 'India', 'Brazil'],
    'Capital': ['Beijing', 'New Delhi', 'Brasilia'],
    'Population': ['1432732201', '1303171635', '207847528']
}

In [5]:
df = DataFrame(data, index=['A','B','C'])

In [6]:
df

     Capital Country  Population
A    Beijing   China  1432732201
B  New Delhi   India  1303171635
C   Brasilia  Brazil   207847528

In [8]:
df[0:2]

     Capital Country  Population
A    Beijing   China  1432732201
B  New Delhi   India  1303171635

In [11]:
df.iloc[0:2, 1:2]

  Country
A   China
B   India

In [14]:
df.loc[['A','B']]

     Capital Country  Population
A    Beijing   China  1432732201
B  New Delhi   India  1303171635

In [17]:
for row in df.iterrows():
    print(row[0],row[1])
    break

A Capital          Beijing
Country            China
Population    1432732201
Name: A, dtype: object

In [18]:
data

{'Capital': ['Beijing', 'New Delhi', 'Brasilia'],
 'Country': ['China', 'India', 'Brazil'],
 'Population': ['1432732201', '1303171635', '207847528']}

In [19]:
s1 = Series(data['Capital'])
s2 = Series(data['Country'])
s3 = Series(data['Population'])

In [25]:
df_new = DataFrame([s1,s2,s3], index=['Capital', 'Country', 'Population'])

In [28]:
df_new = df_new.T

In [22]:
df

     Capital Country  Population
A    Beijing   China  1432732201
B  New Delhi   India  1303171635
C   Brasilia  Brazil   207847528

In [29]:
df_new

     Capital Country  Population
0    Beijing   China  1432732201
1  New Delhi   India  1303171635
2   Brasilia  Brazil   207847528

In [30]:
df_new.index

RangeIndex(start=0, stop=3, step=1)

In [31]:
df_new.index = ['A','B','C']

In [32]:
df_new

     Capital Country  Population
A    Beijing   China  1432732201
B  New Delhi   India  1303171635
C   Brasilia  Brazil   207847528

In [33]:
df

     Capital Country  Population
A    Beijing   China  1432732201
B  New Delhi   India  1303171635
C   Brasilia  Brazil   207847528